## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

needed_value = "stop"

input_value = ""
positives_count = 0

while needed_value != str(input_value):
    input_value = input("value: ")
    if needed_value != str(input_value):
        if int(input_value) > 0:
            positives_count += 1
print(positives_count)    
---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
