## "Все совершенные число в диапазоне"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Найдите все совершенные числа и их количество в заданном диапазоне [a, b].

### Формат входных данных

Даны два целых положительных числа, границы диапазона. Гарантируется, что a < b.

### Формат выходных данных

Вывести все совершенные числа, а затем их количество.

### Решение задачи

a = int(input('a: '))
b = int(input('b: '))

perfect_num_count = 0
dividers_sum = 0

i = a

while i <= b:
    j = 1
    while j < i:
        if i % j == 0:
            dividers_sum += j
        j += 1
    if dividers_sum == j:
        print(j, end=' ')
        perfect_num_count += 1
    i += 1
print(perfect_num_count)    

---

### Подсказки
<details>
<summary>Подсказка-1</summary>
Для решения задачи вам понадобятся вложенные циклы.

```python
while ...:  # внешний цикл
    while ...:  # внутренний цикл
        ...
```
Внешний цикл будет перебирать числа из диапазона, а внутренний проверять, является ли число совершенным.
</details>

<details>
<summary>Подсказка-2</summary>
Для проверки числа на совершенность, воспользуйтесь решение предыдущей задачи "Совершенное число".
</details>
