# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
print(*names, sep = ', ')
# TODO: your code here

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
